{"pageProps":{"source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, {})\n  })) : _createMdxContent();\n  function _createMdxContent() {\n    const _components = Object.assign({\n      h1: \"h1\",\n      h2: \"h2\",\n      p: \"p\",\n      a: \"a\"\n    }, _provideComponents(), props.components), {Alert} = _components;\n    if (!Alert) _missingMdxReference(\"Alert\", true);\n    return _jsxs(_Fragment, {\n      children: [_jsx(_components.h1, {\n        children: \"Links to Other Datasets\"\n      }), \"\\n\", _jsx(_components.h2, {\n        children: \"PHOSP-COVID\"\n      }), \"\\n\", _jsxs(_components.p, {\n        children: [\"The \", _jsx(_components.a, {\n          href: \"https://www.phosp.org/\",\n          children: \"Post-hospitalisation COVID-19 study\\n(PHOSP-COVID)\"\n        }), \" is collaborating with the\\nNational COVID-19 Chest Imaging Database (NCCID). PHOSP-COVID is a\\nnational consortium, led by experts at the University Hospitals of\\nLeicester NHS Trust under the umbrella of the NIHR Leicester Biomedical\\nResearch Centre. It aims to understand and improve long-term health\\noutcomes for patients who have been discharged from hospital with\\nconfirmed or suspected COVID-19.\"]\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"PHOSP-COVID has been set up and funded as a long term research study to\\nrecruit 10,000 patients who have been hospitalised with COVID-19. Over\\nthe course of a year, clinical assessments will track patients to gain a\\ncomprehensive picture of the impact COVID-19 has had on longer term\\nhealth outcomes across the UK.\"\n      }), \"\\n\", _jsxs(_components.p, {\n        children: [\"PHOSP-COVID will be collecting samples and scans for patients from a\\nnetwork of Trusts in the UK (see\\n\", _jsx(_components.a, {\n          href: \"https://www.phosp.org/network/institution-trust/\",\n          children: \"here\"\n        }), \" for the full\\nlist).\"]\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"PHOSP-COVID is collaborating with the NCCID initiative to ensure that\\nthe same sites included in the PHOSP-COVID network are also contributing\\ntowards the NCCID database. This is so that PHOSP-COVID researchers are\\nable to access important data already collected for patients via the\\nNCCID study in order to accompany the longitudinal data PHOSP-COVID are\\ncollecting for patients.\"\n      }), \"\\n\", _jsx(Alert, {\n        title: \"Important information for data collection sites\",\n        children: _jsx(_components.p, {\n          children: \"If you are contacted by the PHOSP-COVID study to upload data but are not yet contributing to the NCCID, we would ask that you follow the instructions here to ensure you are contributing to both studies.\"\n        })\n      }), \"\\n\", _jsx(_components.h2, {\n        children: \"ISARIC\"\n      }), \"\\n\", _jsxs(_components.p, {\n        children: [\"The \", _jsx(_components.a, {\n          href: \"https://isaric.org/\",\n          children: \"International Severe Acute Respiratory and emerging Infection\\nConsortium\"\n        }), \" (ISARIC) was founded in 2011 to prevent\\nillness and deaths from infectious disease outbreaks. It is a global\\nfederation of clinical research networks, providing a proficient,\\ncoordinated and agile research response to outbreak-prone infectious\\ndisease.\"]\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"This consortium is responding to the current COVID-19 outbreak by\\ncreating tools for investigators to collect and store data in a\\nstandardised way and has supported clinical trials of treatments. One of\\nthese tools, the 'Clinical Characterisation Protocol' (CCP), has been\\nco-developed by HDR UK members, in consultation with colleagues at the\\nWorld Health Organisation.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"The CCP sets out how data and biological samples from patients with\\nCOVID-19 should be collected, regardless of where in the world they are.\\nIt's the product of many years of discussion among international\\ninvestigators from a wide range of scientific and medical disciplines.\\nWork to develop this protocol started in response to Middle Eastern\\nRespiratory Syndrome coronavirus (MERS-CoV) in 2012-2013, Influenza H7N9\\nin 2013, viral haemorrhagic fever (Ebolavirus) in 2014, Monkeypox &\\nMERS-CoV in 2018 and Tick-borne encephalitis virus (TBEV) in 2019. It is\\nnow being used for COVID-19 .\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"ISARIC-4C will augment the aforementioned datasets, which have played a\\ncentral role in the UK's research response to COVID-19, with imaging\\ndata from the NCCID. This will support improvements in the\\nunderstanding, diagnosis and prognosis of the disease through the\\navailability of data that comprises a wide range of variables such as\\nclinical measurements, 'omics' assays, and radiology scans.\"\n      })]\n    });\n  }\n}\nreturn {\n  default: MDXContent\n};\nfunction _missingMdxReference(id, component) {\n  throw new Error(\"Expected \" + (component ? \"component\" : \"object\") + \" `\" + id + \"` to be defined: you likely forgot to import, pass, or provide it.\");\n}\n","frontmatter":{},"scope":{"title":"Links to Other Datasets","summary":"The Post-hospitalisation COVID-19 study (PHOSP-COVID) is collaborating with the National COVID-19 Chest Imaging Database (NCCID). PHOSP-COVID is a national consortium, led by experts at the University Hospitals of Leicester NHS Trust under the umbrella of the NIHR Leicester Biomedical Research Centre.","category":"Other Information"}},"meta":{"title":"Links to Other Datasets","summary":"The Post-hospitalisation COVID-19 study (PHOSP-COVID) is collaborating with the National COVID-19 Chest Imaging Database (NCCID). PHOSP-COVID is a national consortium, led by experts at the University Hospitals of Leicester NHS Trust under the umbrella of the NIHR Leicester Biomedical Research Centre.","category":"Other Information"}},"__N_SSG":true}