{"pageProps":{"source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, {})\n  })) : _createMdxContent();\n  function _createMdxContent() {\n    const _components = Object.assign({\n      h1: \"h1\",\n      p: \"p\",\n      h2: \"h2\",\n      a: \"a\",\n      strong: \"strong\",\n      ul: \"ul\",\n      li: \"li\"\n    }, _provideComponents(), props.components), {Alert} = _components;\n    if (!Alert) _missingMdxReference(\"Alert\", true);\n    return _jsxs(_Fragment, {\n      children: [_jsx(_components.h1, {\n        children: \"Performance Assessment Call\"\n      }), \"\\n\", _jsx(Alert, {\n        title: \"Call for AI driven COVID-19 models\",\n        children: _jsx(_components.p, {\n          children: \"Performance assessment using the National COVID-19 Chest Imaging Database\"\n        })\n      }), \"\\n\", _jsx(_components.h2, {\n        children: \"Introduction\"\n      }), \"\\n\", _jsxs(_components.p, {\n        children: [\"The \", _jsx(_components.a, {\n          href: \"https://nhsx.github.io/covid-chest-imaging-database/\",\n          children: \"National COVID-19 Chest Imaging Database\\n(NCCID)\"\n        }), \" was\\ncreated as part of the NHS AI Lab's response to the coronavirus\\npandemic. The NCCID is currently the largest database of medical\\nimages from COVID patients in the UK, and a world-class initiative\\naccelerating the development of AI technologies. This database will be\\nan important resource to train and assess the performance of AI\\ntechnologies that can be used as part of the ongoing response to\\nCOVID-19. The majority of scans collected by the NCCID are chest\\nX-rays and come from people with and without COVID-19. The database\\nalso holds some additional data about the patients who tested\\npositive, such as their gender and age. A portion of these images and\\nclinical data points has been set aside as 'unseen' for the purpose of\\nassessing the performance and fairness of COVID-19 related AI models.\"]\n      }), \"\\n\", _jsxs(_components.p, {\n        children: [\"The NHS AI Lab is now inviting research institutions and technology\\ncompanies that have been developing AI models \", _jsx(_components.strong, {\n          children: \"using COVID-19 chest\\nimaging data\"\n        }), \" to apply to have their model's performance assessed on\\nthe NCCID's unseen dataset. The assessment will be commissioned by\\nNHSX to independent assessors, who will carry out the work with NHSX\\ninvolvement and supervision.\"]\n      }), \"\\n\", _jsx(_components.h2, {\n        children: \"The importance of performance assessment on an unseen, representative dataset\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"The performance of AI models is linked to the characteristics of the\\ndata that they have been trained on, and those they encounter once put\\ninto clinical practice. This is the source of an important concern\\nabout the use of AI in healthcare: how to ensure that the claims made\\nabout a model will prove to be the case in the real world, where the\\ndata can be different from that used to develop it.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Assessing the performance of AI models on a dataset that is\\nrepresentative of the UK population reduces the potential for bias and\\nprovides NHS commissioners and healthcare regulators with the evidence\\nto judge the safety, efficacy, and generalisability of AI models\\nbefore they are used in clinical practice. The NHS AI Lab has been\\nworking closely with NHS commissioners, regulators and end-users to\\ndefine this process, and this performance assessment exercise will\\nhelp to inform how this process may be carried out in the future.\"\n      }), \"\\n\", _jsx(_components.h2, {\n        children: \"How do I apply?\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Before applying, please ensure you are submitting an application for\\nan AI technology developed using chest imaging data that addresses\\nneeds connected to COVID-19.\"\n      }), \"\\n\", _jsxs(_components.p, {\n        children: [\"Applications from technology developers with products that have\\nalready achieved ISO13485 certification or other Quality Management\\nSystem (QMS) certification are particularly welcome. \", _jsx(_components.strong, {\n          children: \"This is not a\\nprerequisite for a product to be eligible for this assessment.\"\n        }), \"\\nHowever, please note that it is a prerequisite of both the derogation\\nand standard pathways for gaining the UKCA/CE mark.\"]\n      }), \"\\n\", _jsxs(_components.p, {\n        children: [\"If you would like to apply, please complete this \", _jsx(_components.a, {\n          href: \"https://forms.gle/bcerY7XQcxeZj4Lg9/\",\n          children: \"application\\nform\"\n        }), \" . If you have any\\nquestions, please contact us on \", _jsx(_components.a, {\n          href: \"mailto:imaging@nhsx.nhs.uk\",\n          children: \"imaging@nhsx.nhs.uk\"\n        }), \". \", _jsx(_components.strong, {\n          children: \"The\\napplication process is open from now and will close at 1pm on 28 May\\n2021.\"\n        }), \" This will be followed by a 3-week review process by a pool of\\nexpert reviewers, by the end of which you will receive feedback on the\\noutcome of your application.\"]\n      }), \"\\n\", _jsx(_components.h2, {\n        children: \"What will I receive at the end of the assessment?\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"The technology developer will receive a written report from the\\nexternal assessors that documents how the AI model in question\\nperformed against the defined performance criteria. This will include\\nan assessment of model performance (sensitivity, specificity etc.),\\nand clinical applicability that can be used as evidence to support\\napplications to the MHRA for derogation of UKCA/CE marking or via\\nstandard conformance assessment processes.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"In addition, depending on the outcome of the exercise, NHSX can\\nsupport technology developers in identifying and making introductions\\nto NHS trusts which have expressed an interest in commissioning new AI\\ntechnologies.\"\n      }), \"\\n\", _jsx(_components.h2, {\n        children: \"Is this a route to regulatory conformance?\"\n      }), \"\\n\", _jsxs(_components.p, {\n        children: [\"No, it is important to note that this process does not replace the path\\nto achieve UKCA/CE/UKNI marking. This is considered to be a validation\\nstudy and does not qualify as a clinical investigation for the purposes\\nof clinical evaluation. In the context of bringing AI models to fruition\\nas part of the COVID-19 response, the developers undergoing the proposed\\nperformance assessment process will, depending on the outcome of the\\nexercise, be able to generate high quality evidence that their model\\nperforms as intended, which they can submit to the Medicines and\\nHealthcare products Regulatory Agency (MHRA) to support their\\napplication for derogation (for more information please visit\\n\", _jsx(_components.a, {\n          href: \"https://www.gov.uk/guidance/exemptions-from-devices-regulations-during-the-coronavirus-covid-19-outbreak#exemptions-for-all-other-kind-of-medical-device/\",\n          children: \"Exemptions from Devices regulations during the coronavirus\\noutbreak\"\n        }), \"\\non the Gov.uk website).\"]\n      }), \"\\n\", _jsxs(_components.p, {\n        children: [\"Alternatively, standard routes to conformity under the device\\nregulations remain open. Evidence generated via the proposed\\nperformance assessment process may form part of a standard regulatory\\nsubmission. For more information please visit \", _jsx(_components.a, {\n          href: \"https://www.gov.uk/guidance/medical-devices-how-to-comply-with-the-legal-requirements/\",\n          children: \"How to comply with the\\nlegal requirements in Great\\nBritain\"\n        }), \"\\non the Gov.uk website.\"]\n      }), \"\\n\", _jsx(_components.h2, {\n        children: \"What will this exercise involve for the technology developer?\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"The NHS AI Lab will be using independent assessors to run the\\nexercise, and assess the performance of the technology developer's AI\\nmodel. By doing this, NHSX aims to source deep subject matter\\nexpertise on both a technical and clinical level, in order to ensure\\nthat the exercise is carried out effectively and objectively. The\\nvalidation will be performed within a cloud-computing infrastructure\\nprovided by NHSX, containing the NCCID unseen dataset. This will\\nguarantee the dataset remains in a safe and secure location, and\\nmitigate the risk of data being shared. The NHS AI Lab's Programme\\nManagement Office will oversee the process.\"\n      }), \"\\n\", _jsx(_components.h2, {\n        children: \"How will the performance of an AI model be assessed?\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"The assessment will be conducted on retrospective data and the\\nfollowing steps will take place:\"\n      }), \"\\n\", _jsxs(_components.ul, {\n        children: [\"\\n\", _jsx(_components.li, {\n          children: \"The external assessors will prepare an analysis plan, including\\nperformance criteria, before the start of the assessment. To support\\nthis, NHSX will facilitate access to a network of regulators,\\nsubject matter experts and end users.\"\n        }), \"\\n\", _jsx(_components.li, {\n          children: \"The technology developer will need to provide precise indications\\nof use for their product. These will be the mechanism by which the\\nperformance criteria are tailored to the AI model, and the only\\ninput of the developer towards them.\"\n        }), \"\\n\", _jsx(_components.li, {\n          children: \"Depending on the AI model to be assessed, it may be necessary for\\nthe assessors to source additional data externally and curate the\\nresources. This is to ensure a dataset large and representative enough\\nto perform an effective assessment. Note that pseudonymised data that\\ndoes not contain patient identifiable information will be used\\nthroughout this process. Due to the continuous growth of the NCCID, the\\nunseen dataset and any complementary data will be versioned\\nappropriately to ensure a fair comparison between models, if required.\"\n        }), \"\\n\"]\n      }), \"\\n\", _jsx(_components.h2, {\n        children: \"What infrastructure will be provided for the assessment process?\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"The computational environment to run the exercise will be provided by\\nNHSX via an AWS sub account on the existing NCCID infrastructure. The\\ninfrastructure will have the following:\"\n      }), \"\\n\", _jsxs(_components.ul, {\n        children: [\"\\n\", _jsx(_components.li, {\n          children: \"Access to the NCCID unseen dataset will be in the form of an S3\\nbucket. The provision of this infrastructure by NHSX is to ensure\\nthe assessment is carried out within a secure environment that meets\\nthe requirements set by information governance. Please note that, at\\nno time, will the technology developer have access to the NCCID\\nunseen dataset.\"\n        }), \"\\n\", _jsx(_components.li, {\n          children: \"Any additional infrastructure required to run the validation\\nprocess will be hosted within this computational environment, but\\nwill be developed by the external assessors. This may include\\ninfrastructure that enables the following:\"\n        }), \"\\n\", _jsx(_components.li, {\n          children: \"Deployment of the AI software by the technology developer, such\\nthat the technology developer can then be locked out whilst the\\nexternal assessment is performed.\"\n        }), \"\\n\", _jsx(_components.li, {\n          children: \"Additional security measures to ensure that both the data and the\\nAI software are protected.\"\n        }), \"\\n\", _jsx(_components.li, {\n          children: \"Assessment of the AI Product against defined performance metrics. |\\nNote that the deployment of the AI software for assessment will be\\nachieved through coordination between the external assessors and the\\ntechnology developer. We anticipate the AI model may be run on a virtual\\nmachine, and therefore may need to be containerised using technologies\\nsuch as Docker.\"\n        }), \"\\n\"]\n      }), \"\\n\", _jsx(_components.h2, {\n        children: \"How will the technology developer's intellectual property be protected?\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"As part of the assessment process:\"\n      }), \"\\n\", _jsxs(_components.ul, {\n        children: [\"\\n\", _jsx(_components.li, {\n          children: \"All members of the performance assessment exercise team, including\\nthe external assessors, will be bound to confidentiality by\\ncontractual arrangements. Where needed, additional Non-Disclosure\\nAgreements (NDAs) will be put in place.\"\n        }), \"\\n\", _jsx(_components.li, {\n          children: \"The computing infrastructure, on which the AI model is deployed,\\nwill ensure that the relevant access controls are in place to\\nprotect the Intellectual Property (IP) of the technology developer.\"\n        }), \"\\n\", _jsx(_components.li, {\n          children: \"Under no circumstances will NHSX or its agents make claims to\\ndeveloper IP, and this will be captured in the contractual\\narrangements prior to commencing the exercise.\"\n        }), \"\\n\"]\n      }), \"\\n\", _jsx(_components.h2, {\n        children: \"How long will the assessment process take?\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"The process end-to-end will take approximately 12-16 weeks to\\ncomplete, depending on the complexity of the model deployment and\\nanalysis.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"How many AI models do you intend to assess? This will depend on the\\nnumber of applications received and the strength of the proposals.\"\n      }), \"\\n\", _jsx(_components.h2, {\n        children: \"How much will this assessment cost me?\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"NHSX will bear the cost of the performance assessment exercise.\"\n      }), \"\\n\", _jsx(_components.h2, {\n        children: \"How will applications be assessed?\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Applications will be scored against a set of defined criteria for each\\nof the following categories:\"\n      }), \"\\n\", _jsxs(_components.ul, {\n        children: [\"\\n\", _jsx(_components.li, {\n          children: \"NHS importance\"\n        }), \"\\n\", _jsx(_components.li, {\n          children: \"Technical feasibility\"\n        }), \"\\n\", _jsx(_components.li, {\n          children: \"Financial viability\"\n        }), \"\\n\"]\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Further details for the above criteria are included in the Application\\nForm.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Applications will be assessed by expert peer reviewers and an\\nappointed committee consisting of technical and clinical advisors.\"\n      })]\n    });\n  }\n}\nreturn {\n  default: MDXContent\n};\nfunction _missingMdxReference(id, component) {\n  throw new Error(\"Expected \" + (component ? \"component\" : \"object\") + \" `\" + id + \"` to be defined: you likely forgot to import, pass, or provide it.\");\n}\n","frontmatter":{},"scope":{"title":"Performance Assessment Call","summary":"The National COVID-19 Chest Imaging Database (NCCID) was created as part of the NHS AI Labs response to the coronavirus pandemic. The NCCID is currently the largest database of medical images from COVID patients in the UK, and a world-class initiative accelerating the development of AI technologies.","category":"Other Information"}},"meta":{"title":"Performance Assessment Call","summary":"The National COVID-19 Chest Imaging Database (NCCID) was created as part of the NHS AI Labs response to the coronavirus pandemic. The NCCID is currently the largest database of medical images from COVID patients in the UK, and a world-class initiative accelerating the development of AI technologies.","category":"Other Information"}},"__N_SSG":true}