{"pageProps":{"source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, {})\n  })) : _createMdxContent();\n  function _createMdxContent() {\n    const _components = Object.assign({\n      h1: \"h1\",\n      h2: \"h2\",\n      p: \"p\",\n      a: \"a\",\n      ul: \"ul\",\n      li: \"li\",\n      hr: \"hr\",\n      h3: \"h3\",\n      code: \"code\"\n    }, _provideComponents(), props.components);\n    return _jsxs(_Fragment, {\n      children: [_jsx(_components.h1, {\n        children: \"Resources for Data Users\"\n      }), \"\\n\", _jsx(_components.h2, {\n        children: \"Data cleaning pipeline and guidelines\"\n      }), \"\\n\", _jsxs(_components.p, {\n        children: [\"We have created a \", _jsx(_components.a, {\n          href: \"https://github.com/nhsx/nccid-cleaning\",\n          children: \"data cleaning\\npipeline\"\n        }), \" in the form of a\\nPython library, which can be used to clean the accompanying clinical\\ndata to the images. This will help with:\"]\n      }), \"\\n\", _jsxs(_components.ul, {\n        children: [\"\\n\", _jsx(_components.li, {\n          children: \"Correcting format errors\"\n        }), \"\\n\", _jsx(_components.li, {\n          children: \"Removing anomalous data\"\n        }), \"\\n\", _jsx(_components.li, {\n          children: \"Remapping categorical values to standardised categories\"\n        }), \"\\n\", _jsx(_components.li, {\n          children: \"xtracting values embedded within strings\"\n        }), \"\\n\", _jsx(_components.li, {\n          children: \"Merging data under old or mis-typed column headers into the\\nnew/correct fields\"\n        }), \"\\n\", _jsx(_components.li, {\n          children: \"Standardising the scales of some clinical variables\"\n        }), \"\\n\"]\n      }), \"\\n\", _jsxs(_components.p, {\n        children: [\"In addition, we have created guidelines for interpreting the clinical\\ndata, compiled in \", _jsx(_components.a, {\n          href: \"/docs/NCCID_schema_compliance_v2.1.xlsx\",\n          children: \"this spreadsheet\"\n        }), \". This will help with:\"]\n      }), \"\\n\", _jsxs(_components.ul, {\n        children: [\"\\n\", _jsx(_components.li, {\n          children: \"Understanding what the expected data format is for each field\"\n        }), \"\\n\", _jsx(_components.li, {\n          children: \"Highlighting where there are known erroneous entries for each field\"\n        }), \"\\n\", _jsx(_components.li, {\n          children: \"Recommending remedial actions for erroneous entries within each field\"\n        }), \"\\n\"]\n      }), \"\\n\", _jsxs(_components.p, {\n        children: [\"An \", _jsx(_components.a, {\n          href: \"/docs/NCCID_site_specific_units.xlsx\",\n          children: \"additional spreadsheet\"\n        }), \" contains information on submitting sites that use\\nmeasurement units for various clinical variable fields that is different\\nfrom the overview of the above schema description. This will help with:\"]\n      }), \"\\n\", _jsxs(_components.ul, {\n        children: [\"\\n\", _jsx(_components.li, {\n          children: \"Transforming clinical measurements on the same range\"\n        }), \"\\n\"]\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Please note that this sheet contains only a subset of potential\\nsubmitting centres, and a subset of clinical variables. Furthermore,\\nresponses for these submitting centres may only represent a subset of\\ntheir hospital sites, where units might vary from hospital to hospital.\\nThe information presented here should only serve as a guide, and always\\nbe checked against values to ensure they are sensible. For some fields\\nyou might have to make decisions on data cleaning and potentially drop\\nvalues that you think are outside the plausible range or entered\\nincorrectly.\"\n      }), \"\\n\", _jsx(_components.hr, {}), \"\\n\", _jsx(_components.h2, {\n        children: \"Frequently Asked Questions\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"This is a list of Frequently Asked Questions with regards to the NCCID\\ndataset content and usage. Feel free to suggest new entries!\"\n      }), \"\\n\", _jsx(_components.h3, {\n        children: \"How often is new data uploaded to the database?\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"It varies but we are aiming for a new data release every week.\"\n      }), \"\\n\", _jsx(_components.h3, {\n        children: \"What is the \\\"Final COVID Status\\\" determined by? We're seeing patients with two negative PCRs with a positive final COVID status.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"The Final COVID Status is the final status that is available for each\\npatient. The fact that there are patients with multiple negative swab\\nresults and the final status which is positive is an example of what\\nhappens sometimes in practice: patients might get tested several times\\nproducing negative results, and then finally result positive. This might\\nbe because sometimes tests are not accurate or because patients fell ill\\nbetween the initial and the final test.\"\n      }), \"\\n\", _jsx(_components.h3, {\n        children: \"Is COVID CODE = Normal the equivalent of \\\"regular\\\" Covid-19 or is it non-Covid-19?\"\n      }), \"\\n\", _jsxs(_components.p, {\n        children: [_jsx(_components.code, {\n          children: \"COVID CODE = Normal\"\n        }), \" refers to the cases where the X-Rays do not show\\nsigns of Covid-19, this might be because the patient does not have it or\\nbecause the patient has only very mild symptoms.\"]\n      }), \"\\n\", _jsx(_components.h3, {\n        children: \"What are the CXR severity scores?\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"The severity scores associated with the chest X-Ray studies are\\nsubjective descriptions provided by the radiologist reviewing the\\nimages, on a scale of three severity levels (Mild = 1, Moderate = 2,\\nSevere = 3).\"\n      }), \"\\n\", _jsx(_components.h3, {\n        children: \"Is the CXR severity score only available for the first two X-Ray studies?\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Yes,the severity information is only available for the first two X-Ray\\nstudies for each patient.\"\n      }), \"\\n\", _jsx(_components.h3, {\n        children: \"How can I match the clinical data points to the corresponding imaging scan?\"\n      }), \"\\n\", _jsxs(_components.p, {\n        children: [\"The temporal information should help you match the information in the\\nsheet with the relevant imaging study: \", _jsx(_components.code, {\n          children: \"Date of 1st CXR\"\n        }), \" and\\n\", _jsx(_components.code, {\n          children: \"Date of 2nd CXR\"\n        }), \" are the dates in which the first two X-Ray scans were\\ntaken and correspond to the two severity values, the time information in\\nthe X-Ray's DICOM should then allow you to identify the imaging scans\\nthat match with those dates.\"]\n      }), \"\\n\", _jsx(_components.h3, {\n        children: \"Date format seems to be inconsistent across date variables (some are in US format and some are in UK format). Why is this? Is there a pattern?\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Yes, it is true that the date format is not consistent across all\\nvariables, but it should be consistent within each single variable (i.e.\\nif it is UK format, all entries for that variable are in UK format).\"\n      }), \"\\n\", _jsxs(_components.p, {\n        children: [\"The dates of the Date of acquisition of 1st RT-PCR and Date of\\nacquisition of 2n RT-PCR are in US format, however we have seen there\\nare a few instances where some sites have inputted additional text in\\nthese fields which will require a small amount of cleaning (e.g.\\n\", _jsx(_components.code, {\n          children: \"Date of 1st CXR\"\n        }), \" with value \", _jsx(_components.code, {\n          children: \"[TEXT] - 2020-03-27\"\n        }), \").\"]\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"All other dates should be in UK or ISO format.\"\n      }), \"\\n\", _jsx(_components.h3, {\n        children: \"Have any of the dates been changed systematically as part of the anonymisation process? Or are the dates in the DICOM files and the clinical variables the actual dates of scans and tests?\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Most dates in the DICOM files have been offset. The excludes the\\nAcquisition date (if present) and the Study Date, so these can be used\\nto identify the time of scan. In addition, the patient's DOB has been\\nreset to the year of birth followed by 0101. The dates in the clinical\\ndata have not been touched.\"\n      }), \"\\n\", _jsx(_components.h3, {\n        children: \"There are cases where patients have multiple JSON files. Why is this? Which one is the correct one?\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Situations with patients who have multiple JSON files can occur when the\\nsites that contribute data to NCCID have uploaded data, then\\nrevised/corrected and then re-uploaded it. We are not currently\\nover-writing files, as it would make data management harder. We suggest\\nthat for each patient you utilise the latest JSON file that you have\\navailable.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Finally, there can also be cases in which the same patient went to two\\ndifferent hospitals, and for which images have been received from two\\ncentres separately. In similar situations, the older JSON files should\\nbe considered.\"\n      }), \"\\n\", _jsx(_components.h3, {\n        children: \"How can I combine the clinical data into a single table/dataset, selecting only the most recent \\\"data\\\" and/or \\\"data\\\" files for each patient?\"\n      }), \"\\n\", _jsxs(_components.p, {\n        children: [\"The development team prepared a tool to help you to aggregate JSON\\nmetadata and convert the results to CSV files. Please check \", _jsx(_components.a, {\n          href: \"https://bitbucket.org/scicomcore/nccid-data-to-csv/\",\n          children: \"this\\nrepository\"\n        }), \", where\\nthe README contains all the relevant information and the relevant\\ndownload links.\"]\n      }), \"\\n\", _jsx(_components.h3, {\n        children: \"How do I tell if the clinical data files are for positive and negative patients?\"\n      }), \"\\n\", _jsxs(_components.p, {\n        children: [\"There are two files, with \", _jsx(_components.code, {\n          children: \"status\"\n        }), \" and \", _jsx(_components.code, {\n          children: \"data\"\n        }), \" in the filename, that can\\nbe used to differentiate between Covid-19 positive and negative\\npatients. Negative patients only have a \", _jsx(_components.code, {\n          children: \"status\"\n        }), \" file, this is because\\ndata providers were told to only submit the minimum information for the\\ncontrol cohort, to make it easier for them. Positives can be identified\\nby the presence of a \", _jsx(_components.code, {\n          children: \"data\"\n        }), \" file which contains relevant clinical\\ninformation, such as their medical history. Some positive patients will\\nhave both files, but their status file can be ignored.\"]\n      })]\n    });\n  }\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{"title":"Resources for Data Users","summary":"We have created a data cleaning pipeline in the form of a Python library,  which can be used to clean the accompanying clinical data to the images. This will help with:","category":"Technical Documentation"}},"meta":{"title":"Resources for Data Users","summary":"We have created a data cleaning pipeline in the form of a Python library,  which can be used to clean the accompanying clinical data to the images. This will help with:","category":"Technical Documentation"}},"__N_SSG":true}